[
  {
    "keyword": "deathtouch",
    "description": "Whenever a creature with deathtouch deals damage to another creature, that creature will die. It does not have to be combat damage, so if you have a card like , it will still kill the creature dealt damage. Normal deathtouch doesn’t kill planeswalkers, but there are some that can give “planeswalker deathtouch” or make tokens with that ability, such as ."
  },
  {
    "keyword": "defender",
    "description": "Creature cannot attack. In the past, there was a rule that said “Walls can’t attack.” So if you see an old creature with the type “Wall”, but it doesn’t have defender in the text-box, it still has defender."
  },
  {
    "keyword": "double Strike",
    "description": "Creature deals both first strike damage and regular damage."
  },
  {
    "keyword": "enchant",
    "description": "Written as “Enchant X” where X is a permanent type These are auras. When cast, auras must have a target. If the target is removed before the aura equips, it goes straight to the graveyard; however, if you return an aura from the graveyard to the battlefield, you may select a target after it enters. There are some weird edge cases where this can get around hexproof."
  },
  {
    "keyword": "equip",
    "description": "Written as “Equip X” where X is a mana cost These are equipment. Equipment are put onto the battlefield, and once the equip cost is paid, it can be attached to a creature. It cannot be unattached from a creature, only moved to another creature. Activate only as a sorcery unless otherwise stated."
  },
  {
    "keyword": "first strike",
    "description": "Creature with first strike deals damage before creatures without first strike in combat. For example, if you have a 2/2 elf and a 2/2 soldier with first strike in combat, the elf would die before it deals damage to the soldier."
  },
  {
    "keyword": "flash",
    "description": "This is on nonland permanent cards (creatures, artifact, enchantments, planeswalkers). Permits you to cast those spells whenever you could cast an instant."
  },
  {
    "keyword": "flying",
    "description": "Creatures with flying can only be blocked by other creatures with flying or by creatures with reach."
  },
  {
    "keyword": "haste",
    "description": "Creatures with haste may attack or activate “tap” abilities the turn they come into play, i.e. no summoning sickness."
  },
  {
    "keyword": "lifelink",
    "description": "Whenever a creature with lifelink deals damage, either to an opponent or creature, you gain life equal to the amount of damage. All damage happens at the same time. If you are dealt lethal damage, but have a lifelink creature to block that brings you back up above 0 life, you would not die. Some abilities say “whenever target creature deals damage, you gain that much life.” That is not lifelink. It is an ability trigger that uses “the stack”, so if you were to be dealt lethal damage, that ability would not gain you the life before your life points are reduced to 0."
  },
  {
    "keyword": "menace",
    "description": "Creatures with menace can only be blocked by 2 or more creatures. When paired with deathtouch, it’s very potent."
  },
  {
    "keyword": "protection",
    "description": "Written as “Protection from X” This is complicated. A creature with protection cannot be damaged, blocked, targeted, enchanted, or equipped by something of that color. This does include your own things. If something gains protection from white, and it has a white aura on it, that aura will fall off. Damage is actually prevented. So if a spell or ability says damage can’t be prevented, then the creature with protection can be damaged. Does not stop “destroy all creatures” spells. Since they do not target the creature, it does not prevent the destruction. It does stop “deals damage to all creatures” spells, because the damage is prevented by protection. Told you, complicated."
  },
  {
    "keyword": "prowess",
    "description": "Whenever you cast a noncreature spell, prowess creatures get +1/+1 until end of turn. Does stack, so if you cast 2 noncreature spells, prowess creatures get +1/+1 for each of those spells, getting +2/+2 total."
  },
  {
    "keyword": "reach",
    "description": "Creatures with reach may block creatures with flying."
  },
  {
    "keyword": "trample",
    "description": "Creatures with trample deal excess damage to defending player. Example You have a 6/6 dinosaur attacking DP (defending player). DP has a 3/3 centaur blocker, and chooses to block your 6/6 dinosaur. You will still deal 3 damage to that player, despite the centaur blocking your creature. Only lethal damage needs to be assigned to a blocker for trample damage to be dealt to the defending player. Therefore, if you have a creature with deathtouch and trample, it needs to only deal 1 damage to the creature. The remaining damage is then dealt to the player."
  },
  {
    "keyword": "vigilance",
    "description": "Attacking does not cause creature to tap."
  },
  {
    "keyword": "ward",
    "description": "Written as “Ward [cost]” If a creature with ward becomes the target of a spell or ability an opponent controls, counter that spell unless the opponent pays the ward cost. Used instead of hexproof for most creatures now, due to hexproof being so difficult to interact with. Keyword Actions Definition: Not an ability, but a special keyword dictating what action a player should take. Attach Used on auras, equipment, and fortifications (only one fortification, , in the game.) Used to “put on” an aura or equipment to a permanent."
  },
  {
    "keyword": "clash",
    "description": "When a spell tells players to clash, each player reveals the top card of their library. When they do, the person with the higher mana value of the revealed card wins the clash. In the event of a tie, there is no winner."
  },
  {
    "keyword": "counter",
    "description": "Countering a spell or ability removes it from the stack. Also called permission, because you get to say “no” to so many things."
  },
  {
    "keyword": "reconfigure",
    "description": "Written as “Reconfigure X” where X is a mana cost These are artifact creatures that are also equipment. Reconfigure can both attach and unattach from a creature, not just move them between creatures. It can also simply be moved. Activate only as a sorcery unless otherwise stated."
  },
  {
    "keyword": "regeneration",
    "description": "Written as “regenerate: [cost]” When the regeneration cost is paid, it gives that permanent a “regeneration shield” for the rest of the turn. If that permanent would be destroyed, instead it is tapped and not destroyed instead. Called a replacement effect. You replace destruction with regeneration."
  },
  {
    "keyword": "sacrifice",
    "description": "The owner of a permanent places it into their own graveyard due to an effect or spell. Some spells cause you to sacrifice a creature as an additional cost, sometimes spells an opponent cast can cause you to sacrifice a creature. There are also many abilities on lands and creatures that allow you to sacrifice them to gain some benefit, such as on the card ."
  },
  {
    "keyword": "scry",
    "description": "Written as “Scry X” where X is a number Look at the top X cards of your library, put any number on the bottom of your library. Put the rest back in any order. Tap/untap Allows you to tap or untap a permanent. Expansion Keywords Definition: Keywords that typically appear only in a certain set/block or in “expert-level” sets, such as Modern Horizons, where stronger cards are purposely printed to be played in formats with larger card pools. Absorb Only on one card: Written as “Absorb X” where X is a number When the creature with absorb is dealth damage, it prevents X damage from whatever source dealt the damage. For example, if Lymph Sliver is to be dealt 3 damage from the card , it prevents 1 of that damage, so only 2 damage would be marked on the card."
  },
  {
    "keyword": "adapt",
    "description": "Written as “[cost] Adapt X”, where X is a number When the adapt cost is paid, put X +1/+1 counters on the creatures whose ability was activated. Many creatures with adapt have an ability that triggers when a counter is put onto it or has an enhanced ability while it has a counter on it."
  },
  {
    "keyword": "adventure",
    "description": "On a card with adventure, you may cast a spell for it’s adventure cost. If you do, exile that card. You may then cast the creature side from exile. You have to cast adventure spell, then creature half. You cannot cast creature half, then adventure from exile. All adventures are instants or sorceries."
  },
  {
    "keyword": "Affinity",
    "description": "Written as “Affinity for X”, where X is a card type Most commonly written as “affinity for artifacts”, a card can have affinity for anything. Affinity causes the generic mana in a casting cost to be reduced by the number of permanents of the X type you control. For example, if you have 4 artifacts, the card requires no mana to be cast, but even if you have 10 artifacts, you must still pay 1 blue mana for ."
  },
  {
    "keyword": "afterlife",
    "description": "Written as “Afterlife X”, where X is an number When a creature with afterlife dies, it’s controller creates X 1/1 black and white spirit tokens with flying equal to the afterlife number."
  },
  {
    "keyword": "aftermath",
    "description": "Only on split cards One side may only be cast from your hand, the other side may only be cast from the graveyard."
  },
  {
    "keyword": "alliance",
    "description": "Basically “Landfall”, but on creatures. Whenever another creature enters, some effect happens."
  },
  {
    "keyword": "amplify",
    "description": "Written as “Amplify X”, where X is a number When you cast a card with amplify, you may reveal any number of cards that share a card type with that card. The card that was cast then enters with a number of +1/+1 counters equal to X times the amount of cards revealed that way. For example, if you cast and reveal 2 dragons from your hand, Kilnmouth Dragon enters with 6 counters on it."
  },
  {
    "keyword": "annihilator",
    "description": "Written as “Annihilator X”, where X is a number Whenever a creature with annihilator attacks, the defending player sacrifices X permanents, where X is the number associated with annihilator. Only on Eldrazi cards (giant colorless space monsters, basically)"
  },
  {
    "keyword": "aura Swap",
    "description": "Written as “Aura Swap X”, where X is a mana cost When a card with aura swap is attached to a creature, you may pay the cost associated with aura swap to return the attached card to your hand and attach an aura from your hand to the same creature. For example, if you have on a 1/1 elf token, then pay 2U to activate the ability, you may return to your hand and place (for example, but could be any other aura in your hand) on the elf token, making it much much much more intimidating. Only on one card, ."
  },
  {
    "keyword": "banding",
    "description": "Historically, THE MOST complicated mechanic in all of MTG history. 53 words of rules text: “Any creatures with banding, and up to one without, can attack in a band. Bands are blocked as a group. If any creatures with banding you control are blocking or being blocked by a creature, you divide that creature's combat damage, not its controller, among any of the creatures it's being blocked by or is blocking.” - From the official MTG rulebook Essentially, when creatures with banding (and up to one without) block or are blocked, you may distribute the damage among your creatures rather than your opponent choosing where the damage goes. This is considered a retired mechanic, but is historically significant. There is a worse version called “bands with other”, and long story short, it is just more difficult to put creatures together for the band. I really don’t wanna explain more, but if you are still interested, visit the ."
  },
  {
    "keyword": "battle Cry",
    "description": "Whenever a creature with battle cry attacks, other attacking creatures get +1/+0 until the end of turn."
  },
  {
    "keyword": "bestow",
    "description": "Written as “Bestow [cost]” When you pay the bestow cost, you use a creature with bestow as an aura for a creature on the battlefield. If the bestowed creature dies, the creature with bestow stays on the battlefield. Great way to protect against a board wipe, while making your creatures stronger."
  },
  {
    "keyword": "blitz",
    "description": "Written as “Blitz [cost]” You may cast a card for it’s blitz cost. If you do, it gains haste. Sacrifice it at the next end step and draw a card. You may only blitz any time you could cast a sorcery."
  },
  {
    "keyword": "bloodrush",
    "description": "Written as “Bloodrush [cost]” You may discard a creature with bloodrush by paying its bloodrush cost. Then, a target creature is granted a boost and abilities based off the discarded creature."
  },
  {
    "keyword": "bloodthirst",
    "description": "Written as “Bloodthirst X”, where X is a number Creatures with Bloodthirst counters enter the battlefield with X +1/+1 counters on them, if an opponent was dealt damage this turn. For example, if was cast on turn 2 with no damage having been dealt to your opponent, it would be a 1/1. If you had played a creature turn 1 and dealt damage to the opponent with it on turn 2, then played , it would enter the battlefield as a 3/3."
  },
  {
    "keyword": "bolster",
    "description": "Written as “Bolster X”, where X is a number Whenever a creature with bolster attacks, you put X +1/+1 counters on target creature you control with the lowest toughness equal to the X in bolster."
  },
  {
    "keyword": "bushido",
    "description": "Written as “Bushido X”, where X is a number If a creature with Bushido is blocked or blocks, it gets +X/+X until the end of the turn, where X is the number associated with Bushido. Only on samurai cards from the original Kamigawa block cards from 2004."
  },
  {
    "keyword": "buyback",
    "description": "Written as “Buyback X”, where X is a mana cost. Only on instants and sorceries. When you cast a card, you may pay the buyback cost. If you do, instead of the card going to your graveyard, it goes back to your hand after resolving. For example, one way to win a game of magic is you generate infinite mana (through a variety of ways), and use to bounce all of your opponents things forever so they can never stop you from winning."
  },
  {
    "keyword": "cascade",
    "description": "Whenever a you cast a card with cascade, exile the top card of your library until you find a card with a lesser converted mana cost, then you may cast that card without paying its mana cost. 2 spells for the cost of 1 spell. Very powerful, considered broken."
  },
  {
    "keyword": "casualty",
    "description": "Written as “Casualty X”, where X is a number When you cast a card with casualty, you may sacrifice a creature with power equal to the X value. If you do, copy the spell."
  },
  {
    "keyword": "champion",
    "description": "Written as “Champion a [creature type]” When you cast a creature with champion, you must exile a card that is the type referred to in the champion keyword. If the champion card leaves play, the exiled card will be returned to the battlefield. Champion is called an “evolution-style” mechanic, where you are sacrificing a worse creature for a better creature."
  },
  {
    "keyword": "changeling",
    "description": "Creatures with changeling count as all creature types, therefore benefitting from all bonuses associated with tribal synergies. Very common in decks without many good creatures of a specific type."
  },
  {
    "keyword": "channel",
    "description": "Written as “Channel [cost]” You may pay the channel cost of a card in your hand, if you do, you discard that card and yield some effect."
  },
  {
    "keyword": "cipher",
    "description": "When you cast a spell with cipher, you may exile it as it resolves. Then, choose a creature to “cipher” the spell onto. Whenever that creature deals damage to an opponent, you may cast the “ciphered” spell without paying its cost. Sounds really strong, but usually sucks… Spells are too expensive for what they do, and creatures are easily killed."
  },
  {
    "keyword": "connive",
    "description": "Written as “[CARDNAME] connives” Whenever a card connives, you draw and discard a card. If a nonland card was discarded this way, put a +1/+1 counter on the creature that connived. Some have an effect when it enters the battlefield, some when attacking, and some with mana costs. Only one card so far has “connives X”, which means you draw X cards and discard X cards."
  },
  {
    "keyword": "conspire",
    "description": "Only on instants and sorceries. When you cast a spell with conspire, you may tap 2 creatures that share a color with the spell. If you do, copy that spell."
  },
  {
    "keyword": "convoke",
    "description": "Convoke allows you to tap creatures to pay for the cost in a spell. Creatures tapped with convoke can either pay for generic costs or colored costs, as long as they are the same color as the mana symbol they are paying. For example, if you have 5 creatures and 4 lands, you may cast for a total of 9 mana, since your creatures help pay the cost."
  },
  {
    "keyword": "coven",
    "description": "If you control at least 3 creatures with different powers, then creatures with coven gain some benefit."
  },
  {
    "keyword": "crew",
    "description": "Written as “Crew X” where X is a number Only on vehicles. To crew a vehicle, you must tap any number of creatures whos power equals X or greater. For example, only needs a creature with 1 power to turn it from an artifact into an artifact creature, but needs 6 power."
  },
  {
    "keyword": "cumulative upkeep",
    "description": "Written as “Cumulative Upkeep [cost]” Old and difficult mechanic. Essentially, the cost compounds each turn, and must be paid at the upkeep step. On your upkeep you place an age-counter on the card with cumulative upkeep, then pay the upkeep cost as many times as there are age-counters on the card. For example, has a cumulative upkeep cost of 1 mana. If you play it on turn 1, that means at the beginning of your 2nd turn you will pay 1 mana or else you sacrifice it. On the third turn you pay 2 mana, turn 4 you pay 3 mana, just to keep the card around."
  },
  {
    "keyword": "cycling",
    "description": "Written as “Cycling [cost] Whenever a card has cycling, you may pay the cycling cost and discard that card. Then you draw a new card. This is useful on cards that are good at certain points in the game, but bad at other points. For example, the card is good early on, when you want to get more lands out. But if you draw it while you already have 12 lands out, it’s typically better to pay 2 mana and get a different card. There are other kinds of cycling, such as “basic landcycling”, where you discard the card, but instead of just drawing a card, you get to search your library for any basic land card and put it into your hand. Very common in budget decks that run a lot of colors. See ."
  },
  {
    "keyword": "dash",
    "description": "You may pay the dash cost for a creature, that creature gains haste and returns to your hand at the end of the turn. Helps you dodge sorcery speed removal spells, like board sweepers. Daybound/Nightbound Example card: The day/night cycle must be introduced by a card with daybound/nightbound. Whenever a player plays 2 or more spells on their turn, it becomes day. If a player casts no spells during their turn, it becomes night. Cards with this mechanic transform or give some benefit to changing day to night or vice versa."
  },
  {
    "keyword": "delve",
    "description": "Delve allows you to exile cards from your graveyard to pay the generic mana cost of the card with delve. For example, with if you have 12 cards in your graveyard, you may pay 1 blue mana and “delve” 7 cards to draw 3 cards while only paying 1 mana. Considered one of the most “broken” mechanics in the game. Lets you cast VERY powerful spells far too cheaply if you can put lots of cards in your graveyard."
  },
  {
    "keyword": "detain",
    "description": "Whenever a player “detains” a permanent, that permanent cannot attack, block, or activate abilities until the start of that player’s next turn. Devour Example card: Written as “Devour X”, where X is a number Whenever a creature with devour enters the battlefield, you may sacrifice any number of creatures you control. The creature with devour then gets X +1/+1 counters for each creature sacrificed this way."
  },
  {
    "keyword": "disturb",
    "description": "Written as “Disturb [cost]” Whenever a card with disturb is in your graveyard, you may cast it for its disturb cost. When you do, it enters the battlefield transformed."
  },
  {
    "keyword": "dredge",
    "description": "Written as “Dredge X”, where X is a number If a card with dredge is in your graveyard, instead of drawing a card, you may put the top X cards of your library into your graveyard where X number associated with the ability, and return the dredge card to your hand. For example, if you have a in the graveyard, instead of drawing a card, you can put the top 3 cards of your library in the graveyard and put back in your hand. Considered very broken, because it allows you to do crazy things with creatures that can automatically come back from the graveyard, such as . It is also often paired with delve to make casting insane cards very easy."
  },
  {
    "keyword": "echo",
    "description": "Written as “Echo [cost]” Whenever a card with echo comes into play under your control, you must pay the echo cost at the beginning of the next upkeep or sacrifice the creature. Old and “bad” mechanic. Just makes you have to pay a lot of mana to keep creatures around."
  },
  {
    "keyword": "embalm",
    "description": "Written as “Embalm [cost]” When a creature is in the graveyard, you may pay the embalm cost to exile that creature from your graveyard and make a token of it. You may only embalm at sorcery speed. Emerge Example card Emerge allows you to sacrifice a creature and pay the difference between the sacrificed creature’s mana cost and the emerge cost. Very similar to offering mechanic in that way."
  },
  {
    "keyword": "entwine",
    "description": "Written as “Entwine [cost]” On cards with 2 options, it allows you to pay mana in addition to the casting cost to do both options."
  },
  {
    "keyword": "epic",
    "description": "After a card with Epic resolves, you may no longer cast spells. Instead, it provides you with (typically), some insane benefit."
  },
  {
    "keyword": "escape",
    "description": "Written as “Escape [cost]” You may cast a card from the graveyard for it’s escape cost by exiling a specified amount of other cards from your graveyard. For example, you may cast for its escape cost and exiling 5 other cards as well."
  },
  {
    "keyword": "evoke",
    "description": "You may cast a card for its evoke cost, but when it enters the battlefield, it is immediately sacrificed. The evoke cost is usually much less than the cost of casting the card. Also, for some reason, entirely on elemental creatures. Not sure what you’d do with that info, but there it is."
  },
  {
    "keyword": "evolve",
    "description": "Whenever a creature with power or toughness greater than a creature with evolve enters the battlefield, put a +1/+1 counter on the creature with evolve. If you play on turn 1, then on turn 2, will have a +1/+1 counter put on it."
  },
  {
    "keyword": "exalted",
    "description": "Whenever a creature you control attacks alone, it gets +1/+1 for each instance of exalted. If you have 2 creatures with exalted, and one of them attacks alone, that is 2 instances of exalted, so that creatures ends up getting +2/+2."
  },
  {
    "keyword": "exert",
    "description": "When a creature with exert attacks, you may “exert” the card. If you do, it does not untap during its controller’s next untap step. Cards grant some ability when you exert them."
  },
  {
    "keyword": "exploit",
    "description": "Whenever you cast a card with exploit, as an additional cost, you may sacrifice a creature. If you do, you gain some benefit."
  },
  {
    "keyword": "explore",
    "description": "Whenever a creature with explore enters the battlefield, reveal the top card of your library. If it is a land card, put it into your hand. If it is a nonland card, you may put it into your graveyard. For each nonland card revealed this way, put a +1/+1 counter on the explore creature. One creature, , has “explore, explore” in the textbox. That means it happens twice. If you reveal a nonland card from the top of your library on the first trigger and choose not to put it into your graveyard, will get 2 counters. If the first card is a land card, and the second is a nonland card, it will get 1 counter, etc."
  },
  {
    "keyword": "extort",
    "description": "Whenever you cast a spell you may pay either white or black mana. If you do, each opponent loses 1 life and you gain life equal to the amount of life lost this way. Because the white mana symbol on extort cards is in the reminder text, extort cards can be played in both monowhite and monoblack commander decks, depending on the casting cost."
  },
  {
    "keyword": "fabricated",
    "description": "Written as “Fabricate X”, where X is a number Whenever a creature with fabricate enters the battlefield, you may either put X +1/+1 counters on that creature or create X 1/1 colorless servo creature tokens."
  },
  {
    "keyword": "fading",
    "description": "Written as “Fading X”, where X is a number Cards with fading enter the battlefield with X fading counters on them. At the beginning of your upkeep, remove a fading counter from that permanent. If you cannot remove a fading counter, sacrifice that creature. Very similar to vanishing. Vanishing is only different because when the last counter is removed, you sacrifice the card. With fading, you keep the card one more turn until you “can’t remove a counter” during your upkeep."
  },
  {
    "keyword": "fateseal",
    "description": "When you “scry” on your opponents’ library. You are allowed to look at the top X cards of the opponent’s library, as dictated by the number in the keyword. You then decide what stays on top of the library and what goes to the bottom."
  },
  {
    "keyword": "fear",
    "description": "Only on black cards. The creature that has fear cannot be blocked except by black and artifact creatures."
  },
  {
    "keyword": "flanking",
    "description": "Whenever a creature with flanking is blocked, the blocking creature gets -1/-1 until the end of the turn. Older mechanic; rare and not all that good."
  },
  {
    "keyword": "flashback",
    "description": "Written as “Flashback [cost]” When a card with flashback is in the graveyard, you may cast it for its flashback cost, then exile it. This mechanic allows you to get 2 uses out of a spell, or it can be paired with dredge to let you cast spells from the graveyard. Some cards have wildly different flashback costs, like ."
  },
  {
    "keyword": "flip",
    "description": "Flip cards are turned upside-down when a certain condition is met. They are not turned face-down, but rotated 180 degrees. Only on cards from the original Kamigawa block."
  },
  {
    "keyword": "forecast",
    "description": "Written as “Forecast [cost]” During your upkeep, you may pay the forecast cost and reveal the forecast card from your hand, then the ability from forecast resolves. Used to get value from a card without losing the card, so you can keep accruing value over several turns."
  },
  {
    "keyword": "foretell",
    "description": "Written as “Foretell [cost]” During your turn, at any time, you may pay 2 to “foretell” a card. You may cast that card for its foretell cost on a later turn. If you foretell a card, you cannot cast it on the same turn you foretell it."
  },
  {
    "keyword": "frenzy",
    "description": "Written as “Frenzy X” where X is a number Whenever a creature with frenzy attacks and isn’t blocked, it gets +X/+0 until the end of turn. Only on one card, the example card."
  },
  {
    "keyword": "graft",
    "description": "Written as “Graft X” where X is a number All creatures with graft are 0/0s that enter the battlefield with X +1/+1 counters on them equal to the graft number. Whenever another creature enters the battlefield, creatures with graft may move one of their counters to the new creature."
  },
  {
    "keyword": "gravestorm",
    "description": "When the spell is cast, copy it for each permanent that entered the graveyard this turn. Only on one card with the mechanic."
  },
  {
    "keyword": "haunt",
    "description": "Once a creature or spell with haunt enters the graveyard, it is exiled and then attached to a creature on the battlefield to “haunt it”. All cards with the haunt mechanic have an enter the battlefield trigger that is the same as the haunt trigger. The haunt trigger occurs when the “haunted” creature is put into the graveyard."
  },
  {
    "keyword": "hideaway",
    "description": "When a card with hideaway enters the battlefield, you look at the top 4 cards of your library. Exile one card under the hideaway permanent. Then, when a condition is met, you cast the exiled card without paying its mana cost. Only on 5 cards from a set called Lorwyn, and one creature from a special set. The creature doesn’t let you cast the spell for free though, so it’s kind of different. There are 5 hideaway lands, , , , , and . Very common in commander."
  },
  {
    "keyword": "horsemanship",
    "description": "Horsemanship is like flying. Creatures with horsemanship can’t be blocked by creatures without horsemanship, unless explicitly stated otherwise. Only from an old set called Portal: 3 Kingdoms. Set in the 3 Kingdoms era in China. Was originally meant to try to get asian people into magic. Very rare nowadays, some very expensive cards in it."
  },
  {
    "keyword": "imprint",
    "description": "Written as “Imprint [something]” When a card with imprint enters the battlefield, it can have you exile almost anything, then gives you some boon based on that. and are very popular in commander."
  },
  {
    "keyword": "indestructible",
    "description": "Creatures with indestructible cannot be removed from the battlefield by effects that say “destroy” nor damage. You can remove indestructible creatures and permanents by exile effects (), -1/-1 effects (), and bounce effects (). Weird thing about indestructible: If you deal “lethal damage” to an indestructible creature, then use a -1/-1 effect, it will die. If you do it the other way around, -1/-1 then damage, it won’t die. Rarely comes up, but something to know."
  },
  {
    "keyword": "inspired",
    "description": "Whenever a card with inspired becomes untapped, something happens."
  },
  {
    "keyword": "investigate",
    "description": "Whenever a card investigates, create a clue tokens. Clue tokens have “Pay 2 mana and sacrifice this artifact, draw a card.”"
  },
  {
    "keyword": "jump-start",
    "description": "Cards with Jump-start may be cast from the graveyard by paying their mana cost and discarding a card."
  },
  {
    "keyword": "kicker",
    "description": "Written as “Kicker [cost]” When you cast a spell, you may also pay the kicker cost to have an additional effect happen. It’s become a joke that all other mechanics are just kicker or flashback, so this is the main mechanic most branch off of. Variant of Kicker called multikicker: You may pay the kicker cost any number of times."
  },
  {
    "keyword": "level up",
    "description": "Cards with level up enter the battlefield at level 0. You may pay the level up cost to put a level counter on that creature. As creatures “gain experience (level up)”, they gain more abilities. You may only level up as a sorcery, but may do so as many times as you want per turn."
  },
  {
    "keyword": "landwalk",
    "description": "Written as “plainswalk” or “islandwalk”,etc Creatures with landwalk cannot be blocked if the defending player has a land that is the type mentioned in the ability. For example, a merfolk with islandwalk cannot be blocked by another creature, even if that creature also has islandwalk."
  },
  {
    "keyword": "living weapon",
    "description": "Cards with living weapon are equipment. When they enter the battlefield, they generate a 0/0 black germ creature token, and attach themselves to that creature. Since the germs have no abilities and are 0/0 creatures, they will die if the equipment becomes unattached (without improving their toughness or something of course)."
  },
  {
    "keyword": "madness",
    "description": "Written as “Madness [cost]” When a spell with madness is discarded, it is exiled. Then, you may cast that card for it’s madness cost. If you don’t cast it, it is then moved to the graveyard."
  },
  {
    "keyword": "manifest",
    "description": "Written as “Manifest [one or more cards]” Manifested cards are face-down 2/2 creatures, just like morphs. Manifested creatures may be turned face up for their mana cost. If a card with morph is manifested, you may use the morph cost/ability instead of the casting cost."
  },
  {
    "keyword": "meld",
    "description": "2 cards can be melded together to create a single creature. Only in one set, not many cards."
  },
  {
    "keyword": "mentor",
    "description": "Whenever a card with mentor attacks, put a +1/+1 counter on target attacking creature with less power than the mentor creature. If for some reason, a mentor card is put into the battlefield attacking, it does not trigger mentor. The act of declaring it as an attacker is what triggers mentor, not the fact that it is attacking."
  },
  {
    "keyword": "miracle",
    "description": "You may cast a card for its miracle cost if it is the first card you draw in a turn. Since the timing on miracles is different, if you draw a sorcery on an opponent’s turn and it has miracle, you may cast it for its miracle cost, even though it is a sorcery. Miracles are very strong in eternal formats where the top of the library can be more easily manipulated."
  },
  {
    "keyword": "modular",
    "description": "Written as “Modular X”, where X is a number Creatures with modular enter with X +1/+1 counters. When a creature with modular dies, it’s counters may be moved to another target artifact creature."
  },
  {
    "keyword": "monstrosity",
    "description": "Written as “[cost]: Monstrosity X”, where X is a number As long as a card has not already become monstrous, you may pay the monstrosity cost and put X +1/+1 counters on that creature. Creatures with monstrosity typically have another benefit than just counters. The monstrosity cost can be activated at any time, so if an opponent is going to target with a “destroy” spell, you can make it monstrous in response to keep it from dying."
  },
  {
    "keyword": "morph",
    "description": "Written as “Morph [cost]” You may pay 3 generic mana and put a card with morph onto the battlefield face down as a colorless 2/2 creature. Then you may pay the morph cost to flip the card face up. This is a special action and cannot be stopped. Morph cards often have a special ability that happens when turned face up. You can stop those with cards like . The only difference between morph and megamorph is that megamorph creatures get a +1/+1 counter when turned face up."
  },
  {
    "keyword": "megamorph",
    "description": "Written as “Morph [cost]” You may pay 3 generic mana and put a card with morph onto the battlefield face down as a colorless 2/2 creature. Then you may pay the morph cost to flip the card face up. This is a special action and cannot be stopped. Morph cards often have a special ability that happens when turned face up. You can stop those with cards like . The only difference between morph and megamorph is that megamorph creatures get a +1/+1 counter when turned face up."
  },
  {
    "keyword": "mutate",
    "description": "Written as “Mutate [cost]” Creatures may be cast for their mutate cost if targeting a non-human creature you control to mutate onto. When a creature mutates onto a creature, you choose whether or not to place it on top or bottom of the creature on the battlefield. Cards on top of the mutate pile determine the power and toughness of the “mutate pile”. The card on top also has all of the abilities of the creatures below them on the pile. For example, if you have a 2/2 bird creature token, and mutate on top of it, you will have a 3/4 creature with flying. The creature will be , but it will have flying because the creature below it has flying.This process can be done several times and have several creatures in a “mutate pile”, which is why it can get so complicated. If the creature you’re trying to mutate onto gets removed, the creature with mutate will still enter the battlefield."
  },
  {
    "keyword": "ninjutsu",
    "description": "Written as “Ninjutsu [cost]” You may return an unblocked attacking creature you control and put a ninja down in its’ place, attacking. Essentially, you just exchange attackers. Most ninjas have triggers that happen when they deal damage, which is good because you are having them deal damage when they enter during combat. When using the ninjutsu ability, it is not casting the spell, so it can’t be countered by cards like but they can also be stopped by cards like ."
  },
  {
    "keyword": "offering",
    "description": "Written as “[creature type] offering” Creatures with offering may be cast as though it has flash if you sacrifice a creature of the appropriate type. Also, the mana cost is altered based on what you sacrifice. For example, has snake offering and a mana cost of 6 generic and 2 green. If you cast it sacrificing a snake with mana cost of 2 generic and a green, you only have to pay 4 generic and 1 green. You just subtract the sacrificed creatures cost from the cost of the new creature."
  },
  {
    "keyword": "overload",
    "description": "Written as “Overload [cost]” When an instant or sorcery is overloaded, instead of targeting 1 target, it affects all targets. specifically says, “target artifact you don’t control”. When overloaded, it destroys all artifacts your opponents control. If something can only target opponent’s cards, the overloaded version will also only affect opponents cards. The opposite is also true."
  },
  {
    "keyword": "persist",
    "description": "If a creature with persist is put into a graveyard from play and had no -1/-1 counters on it, return it to the battlefield with a -1/-1 counter. Doubles up enter the battlefield triggers and death triggers and stuff. Easy to combo with."
  },
  {
    "keyword": "phasing",
    "description": "Old and complicated mechanic Cards that are phased out are treated as though they don’t exist. Any auras and equipment attached do not fall off and are phased out with the creature. It’s similar to exile, but the creatures return at the beginning of their controller’s upkeep. Creatures with phasing both phase in and out at your upkeep, so one turn the are in, the next they are out, then so-on and so-forth. Phasing does not cause enter the battlefield triggers to happen again, as they don’t technically leave the battlefield."
  },
  {
    "keyword": "poisonous",
    "description": "Written as “Poisonous X”, where X is a number Whenever a creature with poisonous deals damage to a player, that player gets X poison counters, where X is the number associated with the ability. If a player has 10 poison counters, they lose the game. Largely been replaced by infect Infect also used poison counters, but creatures with infect put a number of poison counters on a player equal to that creatures power. Creatures with infect don’t deal normal damage. They also deal damage to other creatures as -1/-1 counters instead of normal damage."
  },
  {
    "keyword": "populate",
    "description": "Make a copy of a creature token you control."
  },
  {
    "keyword": "proliferate",
    "description": "Whenever you proliferate, you may add an additional counter to anything that already has a counter. This includes +1/+1 counters, loyalty counters, poison counters, etc. Basically all counters. Great way to lose to poison or infect. You can only add an ADDITIONAL counter. If something does not have a counter, one cannot be placed onto it."
  },
  {
    "keyword": "provoke",
    "description": "When a creature with provoke attacks, its controller may target a creature defending player controls. Then, untap that creature (if applicable). That creature must block the attacking creature with provoke. They mostly suck in general."
  },
  {
    "keyword": "prowl",
    "description": "Written as “Prowl [cost]” A creature may be cast for its prowl cost, only if a creature that shares a creature type dealt damage to a player this turn."
  },
  {
    "keyword": "rampage",
    "description": "Written as “Rampage X”, where X is a number. Whenever a creature with rampage is blocked, it gets +X/+X until end of turn for each creature blocking it."
  },
  {
    "keyword": "rebound",
    "description": "Whenever you cast a card with rebound, exile it. You may cast that card again without paying its mana cost on your next upkeep."
  },
  {
    "keyword": "recover",
    "description": "Written as “Recover [cost]” Whenever a creature is put into a player’s graveyard from the battlefield, all cards with recover trigger. You may then pay the recover cost for each card and return it to your hand. If you do not or cannot pay the cost, the card is exiled instead."
  },
  {
    "keyword": "reinforce",
    "description": "Written as “Reinforce: X - [cost]”, where X is a number You may discard a card with reinforce from your hand and pay the reinforce cost, then put X +1/+1 counters on target creature"
  },
  {
    "keyword": "renown",
    "description": "Written as “Reinforce X”, where X is a number. Whenever a creature with renown deals combat damage to a player for the first time, put X +1/+1 counters on it. It then becomes renown. Most creatures with renown have an ability that only becomes active once it has become renown."
  },
  {
    "keyword": "replicate",
    "description": "Written as “Replicate [cost]” Whenever you cast a spell, you may pay its replicate cost any number of times. If you do, copy that spell for each time you paid the replicate cost."
  },
  {
    "keyword": "retrace",
    "description": "Cards with retrace may be cast from the graveyard if you discard a land card in addition to paying their other costs. Unlike most other versions of this, they are not exiled once cast from the graveyard, so you can keep retracing them as long as you have lands and mana."
  },
  {
    "keyword": "riot",
    "description": "Whenever a creature with riot enters the battlefield, its controller chooses for it to enter with either a +1/+1 counter and haste."
  },
  {
    "keyword": "ripple",
    "description": "Written as “Ripple X”, where X is a number When a spell is cast with Ripple, its controller may reveal the top X cards of their library and cast any copies of that card without paying the mana cost. This triggers ripple again. Considered a pretty bad mechanic. Funnily enough, one card, , is very good. If you have a card that can have any number of them in your deck and you have just a ton of those cards packed in, it will usually win you the game."
  },
  {
    "keyword": "scavenge",
    "description": "Written as “Scavenge [cost]” You may exile a card with scavenge from your graveyard by paying it’s scavenge cost. Then, place a number of +1/+1 counters on target creature."
  },
  {
    "keyword": "shadow",
    "description": "Creatures with shadow can only block or be blocked by other creatures with shadow."
  },
  {
    "keyword": "shroud",
    "description": "Creatures with shroud cannot be the target of spells or abilities. That includes all players."
  },
  {
    "keyword": "soulbond",
    "description": "Creatures with souldbond enter the battlefield and bond to another creature. Both creatures then gain some boon."
  },
  {
    "keyword": "soulshift",
    "description": "Written as “Soulshift X”, where X is a number Whenever a creature with soulshift is put into the graveyard, its controller may return a spirit card from the graveyard to their hand with mana value X or less."
  },
  {
    "keyword": "spectacle",
    "description": "Written as “Spectacle [cost]” You may cast a card for its spectacle cost if an opponent was dealt damage this turn."
  },
  {
    "keyword": "splice",
    "description": "Written as “Splice onto X”, where X is a card type When you cast a card of the specified type, you may pay the splice cost and reveal that card. The effect of the revealed card is then “tacked onto” the spell being cast. Lets you repeatedly “cast” a card without actually casting it."
  },
  {
    "keyword": "split second",
    "description": "A card with split second cannot be interacted with. Once it is on the stack, nothing else can be put there until it has resolved."
  },
  {
    "keyword": "storm",
    "description": "Whenever a card with storm is cast, copy it for each spell cast before it this turn. For example, if you cast 2 and then a , there are actually 3 copies of grapeshot because it is copied 2 times from the 2 lightning bolts cast before it."
  },
  {
    "keyword": "sunburst",
    "description": "A card with sunburst enters with a counter on it for each color of mana used to cast the spell. If a card with sunburst cost 5 generic mana, and you spend 3 green mana and 2 black mana, it only gets 2 counters. If you spend one of every color of mana, it gets 5 counters."
  },
  {
    "keyword": "support",
    "description": "Written as “Support X”, where X is a number When the ability resolves, place a +1/+1 counter on up to X target creatures. You do not have to place them on your creatures."
  },
  {
    "keyword": "surveil",
    "description": "Written as “Surveil X”, where X is a number When the ability resolves, look at the top X cards of your library. You may put any number into your graveyard and rest back on top of your library in any order. Similar to scry, except you cannot put the spells on the bottom of your library."
  },
  {
    "keyword": "suspend",
    "description": "Written as “Suspend X [cost]”, where X is a number You may pay the suspend cost for a card and exile it with X time counters on it. At the beginning of your upkeep, remove a time counter from the card. When the last time counter is removed, you may then cast that spell without paying its mana cost. Creatures with suspend enter the battlefield with haste. If a card does not have a mana cost and only has suspend, it cannot be cast without suspend unless another spell permits you to cast it without paying its mana cost."
  },
  {
    "keyword": "totem armor",
    "description": "Totem Armor is only on auras. If a creature attached with an aura that has Totem Armor would die, instead, the aura is destroyed instead. If multiple Totem Armor auras are attached to a creature that would be destroyed, you may choose one that is destroyed and keep the rest."
  },
  {
    "keyword": "transfigure",
    "description": "Written as “Transfigure [cost]” Any time a sorcery could be cast, you may pay the transfigure cost and sacrifice the creature with transfigure to search your library for a creature with the same mana value. Only on one card."
  },
  {
    "keyword": "transform",
    "description": "Applies to double-faced cards. When some condition is met, you may transform a card from its front side to its back side. What causes a transformation varies widely from in-game actions to mana costs."
  },
  {
    "keyword": "transmute",
    "description": "Written as “Transmute [cost]” When you transmute a card, you pay the transmute cost and discard that card, then search your library for a card with the same mana value."
  },
  {
    "keyword": "tribute",
    "description": "Written as “Tribute X”, where X is a number. Whenever a creature with tribute enters the battlefield, an opponent may pay “tribute” by putting X +1/+1 counters on it. If the tribute is not paid, some other effect will occur."
  },
  {
    "keyword": "undying",
    "description": "When a creature with undying is put into the graveyard, if it had no +1/+1 counters, return it to the battlefield with a +1/+1 counter. Yes, this is persist with +1 counters instead of -1 counters."
  },
  {
    "keyword": "unearth",
    "description": "Written as “Unearth [cost]” When a creature with unearth is in the graveyard, you may pay the unearth cost any time you could play a sorcery. Return that creature to the battlefield, and it gains haste. Exile it at the end step."
  },
  {
    "keyword": "unleash",
    "description": "When a creature with unleash enters the battlefield, its controller may choose to have it enter with a +1/+1 counter on it. If a creature with unleash has a counter on it, it cannot block. The counter does not have to come from unleash, it’s any +1/+1 counter."
  },
  {
    "keyword": "wither",
    "description": "Wither is a replacement effect. If a creature would be dealt nonlethal damage by a creature with wither, it instead has -1/-1 counters placed on it instead of marking normal damage. This is similar to infect, but players do not receive poison counters from creatures with wither. Ability Keywords"
  },
  {
    "keyword": "addendum",
    "description": "Cards with addendum have an added effect if cast in your main phase."
  },
  {
    "keyword": "battalion",
    "description": "Creatures with battalion have an additional effect trigger if they attack with at least 2 other creatures"
  },
  {
    "keyword": "chroma",
    "description": "Cards with chroma check for specific mana symbols in specific zones, then give a benefit or effect based on that."
  },
  {
    "keyword": "domain",
    "description": "Cards with domain have some effect related to the number of basic land types you control. Some good effects, some bad effects."
  },
  {
    "keyword": "enrage",
    "description": "Only on creatures. If a creature with enrage is dealt damage, some type of trigger will occur."
  },
  {
    "keyword": "fateful hour",
    "description": "Cards with fateful hour gain an additional ability if it’s controller is at 5 or less life."
  },
  {
    "keyword": "ferocious",
    "description": "Cards with ferocious gain an additional ability if their controller also controls a creature with more than 4 power."
  },
  {
    "keyword": "grandeur",
    "description": "Very few cards with this and they are bad. Allows you to discard a card with the same name to give it a bonus."
  },
  {
    "keyword": "hellbent",
    "description": "Cards with hellbent give some additional boon or greater effect if you have no cards in hand when the card resolves. If you cast the card, and while it is on the stack, you somehow discard your hand, you will still get the hellbent ability even though you had cards when you cast it. It only checks once the card is going to resolve."
  },
  {
    "keyword": "heroic",
    "description": "Cards with heroic grant some additional benefit when targeted with a spell."
  },
  {
    "keyword": "join forces",
    "description": "Cards with join forces allow all players to contribute mana towards some effect. Meant for commander/multiplayer games."
  },
  {
    "keyword": "kinship",
    "description": "On your upkeep, if you control a card with kinship, you may look at the top card of your library. If it is a creature that shares a type with the kinship creature on the battlefield, you may reveal it for some effect."
  },
  {
    "keyword": "landfall",
    "description": "Cards with landfall have some ability that triggers when a land enters the battlefield."
  },
  {
    "keyword": "metalcraft",
    "description": "Cards with metalcraft gain an additional benefit if it’s controller controls 3 or more artifacts."
  },
  {
    "keyword": "morbid",
    "description": "Cards with morbid gain some effect if a creature died that turn."
  },
  {
    "keyword": "radiance",
    "description": "Basically, if you target a permanent with a spell, that spell affects all permanents of the same type that share a color. If you have 5 white creatures and cast on one, the other 4 with also get +3/+3"
  },
  {
    "keyword": "raid",
    "description": "Cards with raid get some effect if their controller attacked before playing them."
  },
  {
    "keyword": "rally",
    "description": "Cards with rally have some effect trigger whenever a creature with the type Ally enters the battlefield. Sweep Example card: When you cast a spell with sweep, you may return any number of lands with the basic land type as dictated by the card. Some effect is gained from this. Not a good mechanic. Only in old Kamigawa sets."
  },
  {
    "keyword": "threshold",
    "description": "Cards with threshold gain some effect when you have 7 or more cards in the graveyard."
  },
  {
    "keyword": "undergrowth",
    "description": "Cards with undergrowth have effects dependent on the amount of creatures in your graveyard."
  }
]